Revit 2027 API
FabricationPart.GetAllFabricationBodyConnectorDefinitions Method
 Gets all connectors that are valid to be assigned to the part for a specified body connector
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetAllFabricationBodyConnectorDefinitions(
	Connector connector
)
Public Function GetAllFabricationBodyConnectorDefinitions (
	connector As Connector
) As IList(Of Integer)
public:
IList<int>^ GetAllFabricationBodyConnectorDefinitions(
	Connector^ connector
)
member GetAllFabricationBodyConnectorDefinitions :
        connector : Connector -> IList<int>
Parameters
connector Connector
 The connector to to check against
Return Value
IList<Int32>
 Returns an array of connector database identifiers
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace